#ifndef __MANUAL_H
#define	__MANUAL_H

#include "stm32f4xx.h"

/*******************************************************
 *                     结构体定义
 *******************************************************/

 /*
 *************************************************************************
 *                        宏定义
 *************************************************************************  
 */

extern uint8_t HTaskModeFlag;

/************************************************************/

void ManualXMoving(float x);
void ManualYMoving(float y); 
void ManualClose(void);
void ManualOpen(void);
#endif /* __TASK_H */

